"use strict"
/*
•	Какое будет выведено значение: let x = 5; alert( x++ ); ?  Ответ: 5 (Потому что х++, вернет значение а только после увеличит, если бы ++х то было бы 6)

•	Чему равно такое выражение: [ ] + false - null + true ? Ответ: NaN (Потому что пустой массив стока, а дальше есть null итог: это не математическая операция)

•	Что выведет этот код: let y = 1; let x = y = 2; alert(x); ? Ответ: 2

•	Чему равна сумма [ ] + 1 + 2?  Ответ: 12

•	Что выведет этот код: alert( "1"[0] )? Ответ: 1

•	Чему равно 2 && 1 && null && 0 && undefined ? Ответ: null (Оператор && всегда запинаестся на лжи, как только он упрется в любой ложное значение, его и выдаст)

•	Есть ли разница между выражениями? !!( a && b ) и (a && b)? Ответ: false (Первое выражание является булиновым)

•	Что выведет этот код: alert( null || 2 && 3 || 4 ); ? Ответ: 3 ( && в таблице приоритетов идет первой, из 2 и 3 выдаст 3! ИЛИ запинается на правде!)

•	a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ? Ответ: Нет (2 разных хранилища не равны друг другу, даже если в них одинаковое значение)

•	Что выведет этот код: alert( +"Infinity" ); ? Ответ: Infinity

•	Верно ли сравнение: "Ёжик" > "яблоко"? Ответ: нет

•	Чему равно 0 || "" || 2 || undefined || true || falsе ? Ответ: 2
*/
